{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"name","type":"string"},{"name":"title","type":"string"},{"name":"biography","type":"string"},{"name":"presentationTitle","type":"string"},{"name":"presentationSynopsis","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":0,"name":"Dr Halina Talib","title":"Deputy Director (Medical Policy)\nAssurance, Care & Engagement (ACE) Group\nMinistry of Manpower","biography":"Dr Halina Talib is a Deputy Director, Medical Policy, in the Assurance, Care and Engagement (ACE) division of Ministry of Manpower. She leads the development and implementation of healthcare policies and systems for migrant workers and oversees the public health, surveillance, and outbreak response for dormitory-residing migrant workers. She also leads a Clinical Quality and Audit team and oversees an ACE Nursing Team to ensure migrant workers’ access to quality and affordable primary care that enables good health outcomes.\n\nDr Halina graduated from NUS School of Medicine in 1995 and has had more than 2 decades of clinical experience working as a solo medical practitioner and at a well-established Voluntary Welfare Organization before fully pivoting to Occupational Health and policy work. In her past role, she has managed employee health for the Southeast Asia hub of Dow Chemicals, a Fortune 500 US-based multinational corporation, before coming over to join MOM’s fight against Covid-19 in 2020.\n\nShe is a proud parent of 2 young adults and a teenager, and is a history enthusiast, especially in human civilisation and Islamic history. In her spare time, she can be found pottering in her garden, baking in her kitchen or flying out of the country in search of mountains, lakes, ruins and museums.","presentationTitle":"Caring for Migrant Workers - “Joining Hands, Building Bonds’","presentationSynopsis":"To address migrant worker health determinants and care gaps, healthcare provision for migrant workers underwent a radical transformation since the start of the COVID-19 pandemic, aimed at improving the accessibility and affordability of primary and preventive health services, and strengthening public health surveillance.  This presentation focuses on the policy considerations and implementation of an innovative primary care system and its financing model that is dedicated for migrant workers, using a ‘public-private-people’ partnership approach. An overview of the system’s performance, successes and challenges will further highlight the need for an effective and collaborative partnership amongst key stakeholders within the migrant worker ecosystem."},{"index":1,"name":"Mr Yeo Yong Kiat","title":"Deputy Director (Policy, Strategy & Design) \nGovTech","biography":"Yeo Yong Kiat currently serves as Deputy Director (Policy, Strategy & Design) at GovTech, Singapore, and specialises in the development of AI-driven digital solutions for the Singapore public service. Together with a team of 15 engineers, he is working to transform and disrupt key work processes through strategic digital intervention. Aside from AI tools, he is also looking to democratise data exchange across socio-healthcare service providers and all residents, and welcomes partnership with healthcare professionals. He has previously held policy roles in the Ministry of Health and Ministry of Education, with a strong focus in healthcare finance and data analytics respectively. ","presentationTitle":"Data Copilot: Healthcare Analytics Democratised","presentationSynopsis":"To be confirmed"},{"index":2,"name":"Dr Koh Choong Hou ","title":"Senior Consultant Cardiologist\nNobel Heart Centre (Mount Elizabeth Novena Hospital)","biography":"Dr Koh graduated from the National University of Singapore in 2003 and is a dual accredited specialist in Cardiology and Aviation Medicine. He sub-specializes in cardiac imaging (echocardiography) and cardiopulmonary exercise testing. \n\nAs a qualified Aviation Medicine practitioner in the Republic of Singapore Air Force (RSAF) in his early career, he contributed to efforts in the aeromedical training, selection and certification of aircrew for flying-related activities. He is also an appointed medical assessor of the Civil Aviation Authority of Singapore’s Medical Board and conducts regular medical board assessments for commercial aircrew and civilian air traffic controllers, as well as provide cardiovascular specialist advice to the CAMB for complex cases. \n\nIn his last held position as Senior Consultant Cardiologist at National Heart Centre Singapore, he was the Director of the SAF Cardiac Fitness Centre, and was involved in the development of clinical protocols for cardiovascular screening and pre-participation assessment for the Singapore Armed Forces servicemen and pre-enlistees","presentationTitle":"Coronary Artery Disease in Aviators – New Concepts and Insights","presentationSynopsis":"To be confirmed"},{"index":3,"name":"Prof Koh Woon-Puay","title":"Professor, Healthy Longevity Translational Research Programme\nYong Loo Lin School of Medicine, National University of Singapore","biography":"Dr Koh is Professor in the Healthy Longevity Translational Research Programme at Yong Loo Lin School of Medicine in NUS. She received her MBBS (Honours) from NUS, her PhD in immunology from the University of Sydney in Australia, and postdoctoral training in epidemiology from the University of Southern California in USA. Being a population health scientist, Prof Koh’s research is in the epidemiology of chronic diseases such as cancer, cardio-metabolic, musculoskeletal and neurodegenerative diseases. Prof Koh is the Principal Investigator of the Singapore Chinese Health Study, a 63,000-strong cohort of middle-aged and older Chinese Singaporeans established for the long-term study of dietary and environmental factors of chronic diseases. She has co-authored about 480 scientific papers and is a recipient of the NMRC Clinician Scientist Senior Investigator Award. In her role as Assistant Dean and Director for the NUSMed Clinician-Scientist Development Unit, she mentors budding clinician-scientists in NUS.","presentationTitle":"Diet and Healthy Longevity – Examining the Fine Print in the Evidence","presentationSynopsis":"Maintaining a healthy diet is closely linked to longevity. While general advice includes increasing plant-based foods and limiting processed foods and sugars, questions remain if the high-quality dietary patterns, first developed in Western populations, can be applicable to our local cuisines. How about changes in diet after midlife - are they too late in improving health, and how much improvement is necessary? Further, while eating more vegetables and fruits is recommended in general, do fruits and vegetables have different effects with different ageing outcomes? How about specificities and varieties? Are certain fruits and vegetables better than others? Do we still need variety on top of quantity to have optimal effects? In this talk, I will present findings from the Singapore Chinese Health Study cohort over a twenty-year follow-up to examine the fine print in the evidence linking midlife diet to cognitive function, physical frailty and overall health in late life."},{"index":4,"name":"Dr Shawn Vasoo  ","title":"Clinical Director, National Centre for Infectious Diseases\nSenior Consultant, Infectious Diseases, Tan Tock Seng Hospital\nHead, Infectious Disease Research Laboratory, National Centre for Infectious Diseases","biography":"Dr Shawn Vasoo is the Clinical Director and a Senior Consultant at the National Centre for Infectious Diseases (NCID), Singapore. He graduated from the National University of Singapore in 2001, and completed his residency training in Internal Medicine and his fellowship in Infectious Diseases at Rush University Medical Center in Chicago and following that, a Clinical Microbiology Fellowship and Orthopaedic ID fellowship at the Mayo Clinic in Rochester, Minnesota. \n\nAs Clinical Director, he oversees clinical and outbreak preparedness activities at NCID, which is a ~330 bed facility in Singapore purpose-built for outbreaks. He has also been working in the migrant worker space since 2002. He is is a volunteer doctor in Karunya Community Clinic and coordinates the clinic and its medical volunteers, and also serves on the NGO HealthServe’s medical board.","presentationTitle":"Migrant Health in Singapore: Infectious and Non-Infectious Challenges Pre- and Post- COVID","presentationSynopsis":"Migrant health and delivery face peculiar challenges due to a variety of reasons, including health literacy, seeking –behaviour delivery and financing. This talk will provide a broad overview of health-seeking behaviour and delivery prior to COVID-19, and describe the experience with communicable and non-communicable diseases in this population up to the COVID-19 pandemic."},{"index":5,"name":"Adj Asst Prof Selina Seah  ","title":"Assistant Chief Executive Officer (Transformation), Changi General Hospital \nDevelopment Lead, Eastern General Hospital Campus\nDirector, Centre for Healthcare Assistive & Robotics Technology (CHART)","biography":"Assuming concurrent roles as Assistant Chief Executive Officer (Transformation), Changi General Hospital, and the Development Lead for Eastern General Hospital Campus, a new regional health campus to serve the growing needs in the eastern part of Singapore, Selina provides leadership and direction for care transformation, looking at developing enablers in infrastructure, technology and innovations. She is also the Director for the Centre for Healthcare Assistive Robotics and Technology (CHART), which performs R&D and drive the adoption of robotics and assistive technology and evaluate its impact. With an eye on Singapore’s future healthcare landscape, she is also working on strategic partnerships as Deputy Chair at the SingHealth-Duke NUS’s Academic Medicine Innovation Institute.","presentationTitle":"Transforming Healthcare Delivery Through Robotics & Automation","presentationSynopsis":"To be confirmed"},{"index":6,"name":"Dr Stephanie Ko","title":"Consultant, Advanced Internal Medicine, National University Hospital\nLead, NUHS@Home","biography":"Stephanie is a Consultant in Advanced Internal Medicine at National University Hospital in Singapore. She completed her undergraduate medical training in the United Kingdom, and a Masters in Public Health at the Harvard TH Chan School of Public Health. She specialised in Advanced Internal Medicine to further her interest in improving the delivery of healthcare to the evolving population. In 2020, she led a multidisciplinary team to start the NUHS@Home program to delivery hospital-level care beyond the hospital walls. This care model was crucial during the COVID-19 pandemic, which led to the funding of a sandbox and subsequent mainstreaming of Mobile Inpatient Care at Home (MIC@Home) in Singapore in April 2024. Alongside the development of the clinical service, she also leads a collaborative research group to evaluate the implementation and scaling of such care models.  ","presentationTitle":"Hospital Care Beyond Hospital Walls","presentationSynopsis":"In this talk, we will explore the concept of \"Hospital at Home\" or “Mobile Inpatient Care” programs, which aim to deliver hospital-level care in the comfort and safety of the patient's own home. We will discuss the public health implications, including how these programs can alleviate hospital overcrowding, reduce healthcare costs, and potentially lead to better health outcomes by minimizing hospital-acquired infections. Join us to delve into case studies, technology integration, and policy frameworks that are shaping the future of at-home hospital care."},{"index":7,"name":"Ms Cheng Chin Yi","title":"Partner, Cydel Pte Ltd \nAviation & Organisational Psychologist","biography":"Chin Yi started her career with the Ministry of Defence before moving on to the Republic of Air Force where she stayed for 16 years. She moved to the private sector in 2018 and now serves various public and private organisations. Her experience is in a broad range of areas, covering safety and human factors, organisational diagnosis and development, selection and assessment as well as mental health and wellbeing. This has allowed her to consult drawing from diverse content domains, which results in the ability to analyse issues from various perspectives and develop incisive, relevant solutions. She continues to explore new subjects and delve more deeply to further grow her knowledge in her current areas of work.","presentationTitle":"Drivers of Safety Behaviours in Organisations and the Measurement of Organisational Drift","presentationSynopsis":"To be confirmed"},{"index":8,"name":"Cl. Asst. Prof Jimmy Chan Yu Lee","title":"Clinical Director and Senior Consultant\nNg Teng Fong General Hospital Emergency Department","biography":"Dr Jimmy enjoys taking quality care of people and helping them solve their problems. At present he is the Clinical Director at Ng Teng Fong General Hospital Emergency Department. He also has a keen interest in aviation and aerospace medicine as well as aeromedical transport. Dr Lee is particularly interested in emergency medicine supporting exploration class spaceflight and how non-space faring nations can contribute.","presentationTitle":"Space Medicine: A Hitch-hikers Guide to the Galaxy","presentationSynopsis":"To be confirmed"},{"index":9,"name":"Prof (Dr) Gerald Koh Choon Huat","title":"Head & Clinical Director (Future Primary Care)\nMOH Office for Healthcare Transformation","biography":"Professor (Dr) Gerald Koh is Head and Clinical Director of the Future Primary Care programme in Singapore’s Ministry of Health (MOH) Office of Healthcare Transformation (MOHT) where his area of focus is primary care transformation using tele-health, novel technologies and new models of care. He works with stakeholders including public polyclinics and private general practitioners to ensure that solutions which empower patients and providers to improve quality of care can be rapidly prototyped, evaluated, scaled and mainstreamed (e.g. Primary Technology Enhanced Care and Healthier SG). He is also Professor at the Saw Swee Hock School of Public Health (SSHSPH) and Joint Professor, Dean's Office and Department of Medicine, Yong Loo Lin School of Medicine, National University of Singapore (NUS); and Honorary Senior Consultant, Department of Medicine, National University Hospital. A family physician, he obtained his Masters in Medicine (Family Medicine) (NUS) in 2000, Fellowship in Family Medicine (College of Family Physicians Singapore) in 2003, Masters in Gerontology from University of Malta under a United Nations International Institute of Ageing (UN INIA) Fellowship in 2008, and PhD in Family Medicine from Western University (Canada) under both a Schulich Graduate Scholarship and a National Medical Research Council (NMRC) Research Fellowship in 2012. Prior to joining MOHT in 2018, he was Head of the Health Systems and Behavioural Sciences Domain in SSHSPH and received the NUS Outstanding Educator Award in 2016. His research interests include tele-health, primary care, post-stroke rehabilitation, community geriatrics, health services research and medical education through service. In 2021, he was recognised as among the Top 2% of Scientists Worldwide based on a study by Meta-Research Innovation Center at Stanford (METRICS) University. He is currently Principal Investigator of the NMRC-funded National University Health System (NUHS) Research Centre Grant’s Telehealth Core. ","presentationTitle":"The Future of Primary Care in Population Health (& Vice-Versa): Insights from a Personal Journey","presentationSynopsis":"Since medical school, I always thought Family Medicine and Primary Care were intimately bound with Public and Population Health. This was because both disciplines were within the same department then, and it was named Community, Occupational and Family Medicine (COFM). The two disciplines had many commonalities: they were both anchored in the community (as opposed to being hospital-based), generalist in nature (as opposed to specialist care) and bio-psycho-social in approach (as opposed to biomedicine). Unsurprisingly, both disciplines professionalised (i.e. family, occupational and preventive medicine formed their own clinical specializations) and public health grew to encompass epidemiology, biostatistics, modelling, health services research and health economics (with these sub-areas progressively led by non-clinicians). This evolution was worldwide and Singapore was no exception: the Family Medicine part of COFM joined the NUH Department of Medicine and COFM was renamed Department of Epidemiology and Public Health (EPH) in 2009, and EPH became the Saw Swee Hock School of Public Health (SSHSPH) in 2011. I witnessed these changes firsthand as a family physician who joined COFM in 2005 till now as a Professor in SSHSPH. Throughout these past almost 30 years, I have juggled being a family physician, community geriatrician (yes, I also went into community geriatrics and gerontology) and public health professional, in research, teaching and service. I “returned to my Family Medicine roots” in 2018 when I was seconded to MOH Office of Healthcare Transformation to be Clinical Director (and later Head as well) of the Future Primary Care (FPC) team there. I refreshed my relationships with my polyclinic and GP colleagues, built telemedicine in primary care and implemented Healthier SG which seeks to shift the centre of gravity of Singapore’s healthcare towards primary and preventive care. In this lecture, I will share how, despite the divergence of primary care from public health, I never ceased to see these two disciplines as intimately bound, and why and how I foresee these two disciplines will remain intimately bound in the future."},{"index":10,"name":"Prof Benjamin Seet ","title":"Group Chairman Medical Board \nNational Healthcare Group","biography":"Ben Seet oversees research, innovation and academic partnership at the National Healthcare Group. He is Adjunct Professor with the Lee Kong Chian School of Medicine, and currently chairs or serves as a member of the governing board or steering committee of a number of research institutes and organisations in the public and private sectors.  He was formerly Executive Director of the Biomedical Research Council at A*STAR, prior to which he held senior leadership appointments in the Singapore Armed Forces and United Nations. He holds a Master of Public Health from Johns Hopkins University and has a background in international health.","presentationTitle":"Medicine & Technology: A 21st Century Gordian Knot","presentationSynopsis":"The practice of medicine faces two disruptions today: (1) Advances in biotechnology that enable genes to be edited and immune cells to be harnessed to treat the untreatable and to bring advanced cancer and chronic disease into remission. (2) Digital technology and artificial intelligence usher in an age of precision, that leverage on genomic, molecular, clinical, environmental and lifestyle data to predict disease outcomes and guide treatment. All these take place on a background of ageing populations, high prevalence of non-communicable diseases, increasing patient expectations, and escalating healthcare costs. \n\nWhile technology offers compelling propositions to the patient and clinician, it has the potential to fuel a vortex of spiralling complexity and costs. In seeking sustainable healthcare, we need to define what really matters, ask hard questions as to what will make a real-world difference to the patient, and what makes sense for health systems. We need to return to the fundamental principle of doing no harm if we cannot do good, and to avoid the temptations of pushing the latest innovations into our hospitals and clinics. Case studies will be drawn from Singapore’s approach to technology adoption in public healthcare institutions. The need for a patient-centric view in making these decisions will also be discussed."},{"index":11,"name":"Prof Kenji Saito ","title":"Immediate Past President\nAmerican College of Occupational and Environmental Medicine","biography":"Professor Dr. Saito is immediate Past President of the American College of Occupational and Environmental Medicine and Past-President of the New England College of Occupational and Environmental Medicine.  As assistant clinical professor at Dartmouth College, University of New England and Adjunct faculty at the University of Pennsylvania and Instructor at Harvard University, Kenji enjoys training the next generation of leaders in Occupational Health, Safety, Well-being, Leadership and Organizational Development, Digital health, Innovations, Data analytics, Entrepreneurship, Medico-legal consultation and Bioethics.  Growing up as a sushi chef in a small family business kindled Kenji’s entrepreneurial spirit where he is currently involved with several startups in digital well-being, culinary and lifestyle medicine platforms in the Boston, Las Vegas and Los Angeles area and with environmental remediation technology in the Miami area.  He is also a consultant, advisor for employee health and wellness to several national and global companies in the Consumer Products, Marketing, Transportation, Manufacturing, Nutraceutical\/Pharmaceutical industries, and worked with various Government and Regulatory Agencies like State Licensing Board, OSHA, NIOSH, EPA, etc.  As a physician, he continues to practice clinical occupational health, seeing pilots as a senior medical examiner for the FAA and as an attorney, he is barred in the Commonwealth of \nPennsylvania. During his spare time, he enjoys serving as one of the founding board members for Kids’ Chance of Maine, Maine Medical Association and House of Delegate to the American Medical Association.  Dr. Saito is also the Global Medical Director of Owens Corning and previously Sr. Director of Global Wellness at P&G.   ","presentationTitle":"Global Occupational Health: challenges and opportunities of AI, Automation and Robotics","presentationSynopsis":"Come and explore the world of Global Occupational Health as Prof. Dr. Saito discusses and shares his experiences of travels around the world discussing our shared experiences of protecting workers, enhancing the future integrated built environment and how AI, robotics and automation will change the way we work and how occupational health professionals could support these new work paradigm.  \n\nLearning objectives for the talk:\nRecognize the roles of Occupational Health in different regions of the world including, North America, Latin America, Europe, Asia, Middle East and Africa.\nDescribe how AI, robotics and automation will impact workplace dynamics between Safety, HR and OEM.\nAssess how to provide a global perspective to evaluate new OEM technologies using ethical frameworks established by global organizations."},{"index":12,"name":"Dr Rajkumar s\/o Dorajoo","title":"Senior Research Scientist\nLaboratory of Metabolic Disease & Ageing Genomics\nGenome Institute of Singapore, Agency for Science, Technology and Research (A*STAR)","biography":"Rajkumar s\/o Dorajoo is a Senior Research Scientist at the Genome Institute of Singapore (GIS) and leads the Laboratory of Metabolic Diseases and Ageing Genomics. He is also the PI of the genetics sub-cohort of the Singapore Chinese Health Study, a collection of over 25,000 local Singaporean Chinese participants with rich genetic data and extensive longitudinal data on age-related traits and health outcomes that have been curated for over 25 years. His work has been tailored towards using a breath of genomic data to understand biological processes of accelerated ageing and understanding how genetic predispositions and lifestyle exposures, earlier in life, impacts upon age-related health outcomes, later in life.","presentationTitle":"Midlife Obesity and Mobility Dysfunction in Late Life","presentationSynopsis":"Human life expectancy has increased remarkably over the last two centuries. Although we live longer, this is often not matched by healthy life expectancy, indicating that an increasing proportion of old age may be lived in poor health. How exposures such as obesity levels, earlier in life, predisposes to subsequent adverse health outcomes is not well understood, especially in Asian populations. \n\nIn this talk, I’ll present data that indicates on the pernicious effects of excess weight on mobility dysfunction. We evaluated genetic predispositions for body mass index (BMI) in 8,342 Singapore Chinese participants from the Singapore Chinese Health Study, who were followed up from measurement of BMI at midlife (average 53 years), to measurements of Timed Up-and-Go (TUG) test (as a functional mobility measure) 20 years later. A robust 75.83% of genetically determined BMI effects on TUG was mediated through midlife BMI (P = 9.24×10-21). Utilizing Mendelian randomization, we demonstrated a causal effect between BMI and functional mobility (P = 0.001). Secondary gene enrichment evaluations highlighted down-regulation of genes at BMI risk loci that were correlated with poorer functional mobility in the substantia nigra and amygdala regions as compared to all other tissues. These genes also exhibit differential expression patterns during human brain development. In sum, our data highlights that midlife obesity impacts on mobility dysfunction later in life and suggests potential overlap of neuronal pathways that regulate predispositions to obesity and mobility dysfunction."},{"index":13,"name":"Prof David Chan","title":"Lee Kong Chian Professor of Psychology \nDirector, Behavioural Sciences Initiative\nSingapore Management University","biography":"David Chan is Professor of Psychology and Director of the Behavioural Sciences Initiative at the Singapore Management University. His research in diverse areas of social-behavioural sciences, published in top psychology, management and methods journals, have been cited over 15,000 times in various disciplines. In 2020, a Stanford University study of researcher impact named him in the top one percent worldwide among all scientists across all disciplines. He is Elected Fellow of six international psychological associations. He has received numerous international scholarly awards such as the Distinguished Early Career Contributions Award, the Scientist-Practitioner Presidential Recognition Award and the Raymond Katzell Award in Industrial and Organizational Psychology. In Singapore, he serves on numerous national councils, taskforces, scientific advisory panels and boards of directors, and he has received several national awards for his contributions. He writes by-invitation op-eds in The Straits Times and he is consultant to Channel NewsAsia on several documentary series.","presentationTitle":"Extending the Frontiers in Health through Evidence-based Contextualisation: Contributions from the Social and Behavioural Sciences","presentationSynopsis":"As we transform the healthcare ecosystem and shift to a more proactive illness prevention framework, it is critical to adopt an evidence-based contextual approach for different settings and population segments. This involves understanding the science underlying how people think, feel and behave in various situations, so that we can effectively apply principles to progress towards the twin goals of illness prevention and health promotion. Drawing on his wide-ranging expertise and experience in evidence-based applications of social and behavioural sciences, Professor David Chan will explain how various effective approaches are rooted in the core aspects of what constitute people-centricity. He will discuss how the science and practice of health and well-being, motivation, adaptability and resilience can help us better understand and apply people-centric approaches in ways that will enable individuals and organisations to not only survive but thrive as we live, learn, work and play amid rapidly changing challenges and demands."},{"index":14,"name":"Prof Andrea B. Maier","title":"Oon Chiew Seng Professor in Medicine, National University of Singapore\nCo-Founder, NUS Academy for Healthy Longevity, National University of Singapore","biography":"Andrea B. Maier (1978), a Fellow of the Royal Australasian College of Physicians (FRACP), graduated in Medicine (MD) 2003 from the University of Lübeck (Germany), was registered 2009 in The Netherlands as Specialist in Internal Medicine-Geriatrics and was appointed Full Professor of Gerontology at Vrije Universiteit Amsterdam (The Netherlands) in 2013. She was the head of Geriatrics at the Vrije Universiteit Medical Center from 2012 to 2016. From 2016 to early 2021 Professor Maier served as Divisional Director of Medicine and Community Care at the Royal Melbourne Hospital, Australia, and as Professor of Medicine and Aged Care at the University of Melbourne, Australia. She continued her career at the National University of Singapore as Director of the Centre for Healthy Longevity. Professor Maier’s research focuses on unraveling the mechanisms of ageing and age-related diseases to bring diagnostics and interventions to optimize health into clinical practice. She is heading international longitudinal cohort studies and geroscience interventions. She has published more than 400 peer-reviewed articles, achieving an H index of 72, spearheading the significant contributions of her highly acclaimed innovative, global, multidisciplinary @Age research group. She is a frequent guest on radio and television programs and book author to disseminate aging research. Furthermore, she is invited member and advisor of several international academic and health policy committees and funding agencies, including the World Health Organization evaluating the United Nations Decade of Healthy Ageing and Hevolution. In 2022, she co-founded the first evidence based Healthy Longevity Medicine Clinic in Singapore, Chi Longevity, and joined NU as Chief Medical Officer. She is the past President of The Australian and New Zealand Society for Sarcopenia and Frailty Research, the Founding President of the Healthy Longevity Medicine Society and serves as selected Member of The Royal Holland Society of Sciences and Humanities, Fellow of the Atria Academy of Science and Medicine, and Academy for Health and Lifespan Research. In 2023, she co-founded the NUS Academy for Healthy Longevity to disseminate Geroscience and evidence based Healthy Longevity Medicine.","presentationTitle":"Closing the Gap between Healthspan and Lifespan: Healthy Longevity Medicine","presentationSynopsis":"Medical research has traditionally focused on disease mechanisms and therapies to restore health. This approach has been highly effective, but because of its effectiveness, demographics of countries are changing. Chronologic age is the largest risk factor for decline in organ function and for age-related diseases, which are now highly prevalent. Therewith, healthcare costs are steadily increasing and the gap between healthspan, the duration an individual maintains good health, and lifespan is escalating. The biological age of individuals can now be measured by use of biomarkers of ageing. Furthermore, geroprotective interventions are readily available to lower the biological age and therewith preventing age-related diseases and increasing healthspan. Geroprotectors include highly personalized lifestyle modifications, supplements and medication which are chosen based on the biological, clinical and digital fingerprint of individuals. The efficacy of the intervention is tested by remeasurement of the biological age and interventions adapted accordingly. Healthy Longevity Medicine using cutting edge evidence-based diagnostics and interventions is being implemented into healthcare internationally, to address the challenges of an ageing society - closing the gap between healthspan and lifespan."},{"index":15,"name":"Assoc Prof Lim Wee Shiong ","title":"Senior Consultant, Department of Geriatric Medicine, Tan Tock Seng Hospital\nDirector, Institute of Geriatrics and Active Aging, Tan Tock Seng Hospital","biography":"A\/Prof Lim Wee Shiong is the Director at IGA, and Senior Consultant at the Department of Geriatric Medicine, TTSH. He is Associate Professor (Clinical Practice) at Lee Kong Chian School of Medicine, NTU; Adjunct Associate Professor at Yong Loo Lin School of Medicine, NUS; Fellow of the American Geriatrics Society; and Associate Fellow of the Association for Medical Education in Europe. A\/Prof Lim’s comprehensive track record of scholarly work as a “Geriatrician-Educator-Researcher” included over 200 peer-reviewed publications; Associate Editor of Journal of Frailty and Aging; and research and teaching awards in Geriatric Medicine and Health Professions Education. He is actively involved in international, regional and national workgroups in sarcopenia and frailty, including the Asian Working Group for Sarcopenia (AWGS), Asian Working Group for Cachexia (AWGC), and Global Leadership Initiative in Sarcopenia (GLIS). He is also the principal investigator of the seminal GERI-LABS and GERI-LABS2 longitudinal cohort studies in frailty and sarcopenia.","presentationTitle":"Moving from Frailty-readiness to Frailty-resilience: Can We Get There?","presentationSynopsis":"Ageing has been described as the biggest social transformation in Singapore for this generation. In Singapore, the journey to deliver quality healthcare amidst challenges posed by increasing prevalence of frailty with ageing populations is marked by three key epochal transitions: 1) Frailty-reality healthcare system; 2) Frailty-ready healthcare system; and 3) Frailty-resilient health system.\n\nThe multifaceted physical, cognitive, functional and psychosocial needs of frail older persons have rendered the conventional modus operandi of reactive, fragmented, facility-centric, doctor-based, and illness-centered care delivery as clearly unsustainable. In response, Singapore underwent a transformational journey underpinned by the Ministry of Health (MOH)’s three beyonds: beyond healthcare to health, beyond hospital to community, and beyond quality to value. The aim was to forge a frailty-ready healthcare system across the frailty spectrum, ranging from the well healthy (“living well”), well unhealthy (“living with illness”), unwell unhealthy (“living with frailty”), and end-of-life (“dying well”). Recent developments include the 2023 Action Plan for Successful Aging Plan anchored on the 3Cs of care, contribution and connectedness; Healthier SG initiative involving primary care doctors and community care partners as key partners in the implementation efforts for healthy ageing; and the multi-ministry Age Well SG, a national preventative programme to help seniors age actively, stay socially connected, and be cared for within their own communities.\n\nAs Singapore prepares for a super-aged society, it is incumbent upon policy makers, healthcare practitioners, community partners, academics and the lay public to unite their efforts to forge a frailty-resilient health system that enables older persons “to be and to do what they value for as long as possible.”"},{"index":16,"name":"Adj Assoc Prof Matthias Paul Toh","title":"Director & Senior Consultant, National Public Health & Epidemiology Unit, National Centre for Infectious Diseases\nAdjunct Associate Professor, Saw Swee Hock School of Public Health, National University of Singapore","biography":"Adjunct Associate Professor Matthias Toh is a Public Health Physician. He is a Past President of the College of Public Health and Occupational Physicians, Academy of Medicine Singapore. He has special interest in disease prevention and control, health promotion and primary care. \n\nHe joined NCID in 2019 where he serves as Director and Senior Consultant of the National Public Health & Epidemiology Unit (NPHEU). He oversees the national HIV registry and coordinates operations for contact tracing. He leads the epidemiology team to provide insights on global and local situation for communicable diseases. \n\nHe is an Adjunct Associate Professor with the Saw Swee Hock School of Public Health (NUHS) and Clinical Core Faculty Member for National Preventive Medicine Residency Program.","presentationTitle":"To be confirmed","presentationSynopsis":"To be confirmed"},{"index":17,"name":"Dr Robin Low","title":"Head, Occupational and Aviation Medicine Service\nChangi General Hospital","biography":"Dr Robin Low the Head of CGH’s newly set up Occupational and Aviation Medicine Service. A specialist in both Aviation Medicine and Occupational Medicine, Dr Low spent 20 years in the Republic of Singapore Air Force, before joining the private sector.  He joined CGH in 2021 as the Director of Changi Aviation Medicine Centre.  Dr Low has a broad range of experience in clinical as well as operational aviation medicine, which he also applies to his practice of Occupational Medicine. During his time in the RSAF, he developed a special interest in the field of human factors and human error reduction, and this also drives the hands-on approach to his practice of both specialties.","presentationTitle":"A Different Paradigm in Managing Health of Shift Workers","presentationSynopsis":"In the modern world, an estimated 15-20% of workers are working a shift schedule.  The health hazards of shift work are well known to preventive medicine specialists and includes higher burden of coronary artery disease, stroke, type two diabetes and even accidents.  As businesses becomes more global and connected, and society progresses towards a “always on” 24 hour mode, the health burden of shift work will increase accordingly.  With the current swing in healthcare towards a focus on prevention, it is important to consider if it is possible to look for ways to prevent or reduce the health burden of shift work in such workers.  In this talk, the speaker will review the health hazards of shift work, and explore new  and (and some not so new) ways of managing workers on shift work, with the aim to reduce the health hazards and improve the health of shift workers."},{"index":18,"name":"Dr Loh Chin Hui","title":"Director, Workplace Health and Outreach Division\nHealth Promotion Board","biography":"Chin Hui oversees the Workplace Health and Outreach Division within HPB. The division works closely with key partners such as the Ministry of Manpower (MOM), Workplace Safety and Health Council (WSHC), Singapore National Employers Federation (SNEF), National Trades Union Congress (NTUC) and other trade \/ industry unions to deliver Workplace Health Programs in key areas such as Physical Wellness, Mental Health, Nutrition, Health Screening and Health Coaching, across a wide range of companies and workers. Our collective efforts have allowed us to reach over 1.3 million workers in Singapore so as to better support the health of employees in the workplaces.","presentationTitle":"Frontiers in Workplace Health Outreach","presentationSynopsis":"HPB will share on some of the key approaches and innovations that has been developed and implemented to enhance the reach and impact of workplace health programs to different archetypes of workplaces and workers. \n\nThis will include curating the language, content and delivery modality for hawkers and heartland mall workers. Supporting SMEs in a manner that better meets their ground realities. Working with key Strategic Partners to design and develop workplace health programs so that it can be positioned as a part of their operating model.     \n\nHPB will also share on some of the key challenges and success factors in our experience in delivering more holistic workplace health programs.\n"},{"index":19,"name":"Dr Loh Yik Hin","title":"CEO, St. Andrew's Community Hospital\nCOO, St. Andrew's Mission Hospital\nDirector (Healthcare Services), Singapore Anglican Community Services\n","biography":"A public health physician, Dr. Loh spent the first 13 years of his public health career at the Singapore Ministry of Health, in areas such as Health Service Development, Health Regulation, Quality and Safety, and Health Technology Assessment.  He has devoted his last 16 years to community healthcare in the non-profit sector through his work at the St. Andrew's Mission Hospital and Singapore Anglican Community Services. He is also currently Chairman of the Agency for Integrated Care's Medifund Committee, Chairman of the Institute of Technical Education's Health Care Academic Advisory Committee, and member of the CareShield Life Council, National Organ Transplant Ethics Committee and Nanyang Polytechnic Health Sciences Advisory Committee.","presentationTitle":"Providing Holistic Primary Care through Singapore's First Medical Centre for Migrant Workers -- St Andrew's Migrant Worker Medical Centre","presentationSynopsis":"To be confirmed"},{"index":20,"name":"Dr Haruki Matsumoto","title":"Director, Healthcare Safety and Inspection Office\nHealth Policy Bureau\nMinistry of Health, Labour and Welfare\nGovernment of Japan\n","biography":"Haruki (Harry) Matsumoto, MD, MPH, is a public health professional with extensive experience in healthcare policy and administration. After earning his MD from Chiba University School of Medicine in 2006 and completing his medical internships, he worked as a resident physician in emergency medicine until 2009. Joining the Ministry of Health, Labor, and Welfare, Haruki has held several pivotal roles. As a Specialist for Health Technology Assessment, he introduced the first cost-effectiveness assessment system for drugs and medical devices within Japan’s public health insurance system. He furthered his expertise by obtaining an MPH from Harvard T.H. Chan School of Public Health (2016-2018), focusing on health policy. Since August 2023, he has served as the Director of the Healthcare Safety and Inspection Office at the Health Policy Bureau in Tokyo. Previously, as the Director-General of the Department of Health and Welfare at the Niigata Prefectural Government, he led significant health system reforms and achieved the lowest COVID-19 mortality rate among Japanese prefectures.","presentationTitle":"Homecare in Japan: Lessons for an Aging Asia","presentationSynopsis":"To be confirmed"},{"index":21,"name":"Adj Asst Prof Ng Yih Yng\n","title":"Director, Digital and Smart Health Office, Centre for Healthcare Innovation, National Healthcare Group\nClinical Director, WHO Collaborating Centre, Lee Kong Chian School of Medicine, Nanyang Technological University\nSenior Consultant, Department of Preventive and Population Medicine, Tan Tock Seng Hospital","biography":"A\/Prof. Ng Yih Yng is the Director of the Digital and Smart Health Office for the Ng Teng Fong Centre for Healthcare Innovation (CHI) and a faculty with the Lee Kong Chian School of Medicine (LKC-SOM), Nanyang Technological University (NTU) in Digital Health and AI, as well as the clinical director of the LKC-SOM, NTU World Health Organisation collaborating centre for Digital Health & Health Education. He is a Senior Consultant, Department of Preventive & Population Medicine at the Tan Tock Seng Hospital involved in Population Health and Digital Health Transformation.\n \nYih Yng was previously a military emergency physician in the SAF, the Chief Medical Officer of the SCDF and the HomeTeam of MHA before joining TTSH and NHG to do emergency medicine, public health and administration. He was responsible for the transformation of the SCDF 995 call center operations, SCDF emergency medical services, starting a HomeTeam Medical Services Division and national initiatives like the HDB Save-a-Life AED program, SCDF myResponder mobile app and first national prehospital EMR system, OMNII.  \n  \nHe has clinical interest in resuscitation, digital health, innovation, AI and public health systems.\n","presentationTitle":"Mind The Gap - Bridging the Digital Divide in Healthcare","presentationSynopsis":"To be confirmed"},{"index":22,"name":"Prof Vernon Lee","title":"Executive Director\nInterim Communicable Diseases Agency (Singapore)\n","biography":"Professor Vernon Lee is a preventive medicine physician with extensive global health experience in pandemic preparedness and response, infectious disease epidemiology and health policy and management. He played an instrumental role in developing and implementing Singapore’s COVID-19 pandemic response, and has also responded to the 2003 SARS outbreak, 2009 influenza pandemic, and the 2016 Zika outbreak in Singapore.\n\nProf Lee previously served as Advisor to the Assistant Director General for Health, Security and Environment at the WHO headquarters in Geneva; Medical Epidemiologist in the WHO’s Country Office in Indonesia; and Head of the Biodefence Centre in the Singapore Armed Forces. Through his work, Prof Lee has been involved in major global health security collaborations, and in developing pandemic preparedness plans, risk assessment and disease management programmes. He continues to serve on expert committees at the international level.\n\nAn avid supporter of evidence-based health policy, Prof Lee has published about 200 scientific papers, many in top journals, including the New England Journal of Medicine (NEJM), Journal of the American Medical Association (JAMA), and the Lancet journals. He is an Adjunct Professor at the Singapore’s Saw Swee Hock School of Public Health.\n\nProf Lee graduated from medical school at the National University of Singapore. He also holds a PhD in epidemiology from the Australian National University, and the Master in Public Health and Master of Business Administration degrees from the Johns Hopkins University, USA.\n","presentationTitle":"The Communicable Disease Agency – Integration for Efficient and Coordinated Outbreak Response","presentationSynopsis":"To be confirmed"},{"index":23,"name":"Dr Faraz Khalid","title":"Research & Innovation Office, Special Program for Primary Healthcare\nWorld Health Organization Headquarters\n","biography":"Faraz Khalid is currently a Research and Innovation Officer at Special Program for Primary Health Care at WHO Headquarters, and before this role, he was responsible for coordination of Universal Health Coverage reforms at the WHO’s Eastern Mediterranean Regional Office, where he supported fourteen countries across the region. \n\nHe has taken on multiple roles in the low- and middle-income countries health systems in the last seventeen years. He started his career as a medical doctor, transitioned to a program manager of an award winning innovative mhealth enabled social health protection program in Pakistan, has worked as health systems and financing consultant with World Health Organization, UNICEF, Asian Development Bank, and USAID. \n\nFollowing his medical training, he completed his PhD in Global Health Policy and Management from Tulane School of Public Health and Tropical Medicine, USA and did Master’s in public health from London School of Hygiene and Tropical Medicine.\n","presentationTitle":"Overview of PHC Global Report - 'Implementing the Primary Health Care Approach: A Primer'","presentationSynopsis":"To be confirmed"},{"index":24,"name":"Dr Sharifah Badriyah Alhadad","title":"Research Fellow, Heat Resilience & Performance Centre\nYong Loo Lin School of Medicine, National University of Singapore\n","biography":"Dr Sharifah Badriyah Alhadad is a Research Fellow in the Heat Resilience & Performance Centre at the National University of Singapore (NUS). She earned her PhD in thermal and exercise physiology under the Integrative Sciences and Engineering Programme at NUS, where she investigated the efficacy of ice slurry ingestion as a heat mitigation strategy in athletic, occupational, and educational settings. Her current research aims to deepen our understanding of how rising heat exposure can adversely impact human performance, health and safety in the face of global warming, and identify strategies to enhance heat resilience and tolerance of heat-exposed individuals.  ","presentationTitle":"Heat Resilience - Bridging Research and Policy","presentationSynopsis":"Global temperatures are rising at an alarming rate, presenting a formidable challenge worldwide. By 2050, it's estimated that two-thirds of urban populations will confront potentially lethal heat waves. With its persistent high temperatures and humidity, Singapore stands particularly vulnerable to these threats, magnifying the risks for its residents. In our presentation, we'll explore the multifaceted impacts of heat on human performance, health, and safety, encompassing both established and emerging issues. Furthermore, we'll explore proactive strategies for managing and mitigating these risks, emphasizing the essential role of evidence-based research in fortifying heat resilience across diverse sectors. By shedding light on the urgency and complexity of these challenges, we aim to underscore the importance of collective action to safeguard human health and well-being and enable humans to thrive amidst the mounting heat stress of our warming world."},{"index":25,"name":"Adj A\/Prof Eugene Shum ","title":"Director, Community Partnership \nSingHealth Office of Regional Health \nSingHealth\n","biography":"Dr Eugene Shum is Director, Community Partnership at the SingHealth Office of Regional Health. He has extensive experience in community engagement and facilitates the integration of health and social care services in the community. Through partnerships with community organisations, he has developed pioneering health-social initiatives such as the Neighbours for Active Living programme and CareLine, a 24\/7 nationwide telecare service which received the Ministry of Health National Clinical Excellence Team Award in 2022. Dr Shum was previously Director, Medical Affairs and Innovation at Khoo Teck Puat Hospital. He has held various portfolios at the Ministry of Health, Singapore. \n\nDr Shum is a preventive medicine physician. He obtained his MBBS from the National University of Singapore and his Masters of Public Health from the Bloomberg School of Public Health, Johns Hopkins University. He is Adjunct Associate Professor at the Saw Swee Hock School of Public Health, National University of Singapore.\n","presentationTitle":"Digital Innovation in Population Health","presentationSynopsis":"*Pending*"},{"index":26,"name":"Dr Nicolas Van de Velde","title":"Executive Director of Health Economics and Outcomes Research\r\nModerna\r","biography":"Dr. Nicolas Van de Velde joined Moderna during the pandemic as the Executive Director of Health Economics and Outcomes Research for COVID-19. He has over 20 years of experience in vaccines, ranging from academic research to full-scale manufacturing in the industry. Dr. Van de Velde holds an MBA from Imperial College London, a PhD in Epidemiology from Université Laval (Canada), an MSc in Infectious Diseases from St Mary’s Hospital (London), and a Master of Engineering in Biochemistry from Ecole Polytechnique (Brussels). He has published over 100 articles, which have accrued nearly 2000 citations, in top journals within vaccinology, epidemiology, and public health. Dr. Van de Velde has contributed to the development and commercialization of vaccines against some of the most prevalent and deadly infectious diseases, including HIV\/AIDS, malaria, HPV, rotavirus, meningitis, shingles, and COVID-19. He is also listed as an inventor on a patent for pneumococcal vaccines. Moving forward, his mission is to leverage Moderna’s mRNA technology to tackle global health challenges, ultimately creating healthier, more equitable and productive communities worldwide.","presentationTitle":"Frontiers in Vaccine Technology and Novel Vaccines","presentationSynopsis":"*Pending*"}]}